## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_key_vault.equalvote has been deleted
  - resource "azurerm_key_vault" "equalvote" {
      - id                              = "/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.KeyVault/vaults/equalvote" -> null
        name                            = "equalvote"
        tags                            = {}
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault.equalvote will be created
  + resource "azurerm_key_vault" "equalvote" {
      + access_policy                 = [
          + {
              + key_permissions    = [
                  + "Create",
                  + "Decrypt",
                  + "Delete",
                  + "Encrypt",
                  + "Get",
                  + "GetRotationPolicy",
                  + "List",
                  + "Purge",
                  + "Recover",
                  + "SetRotationPolicy",
                  + "Update",
                ]
              + object_id          = "e4536f07-8f5a-4501-be90-6a3d2a09b0f3"
              + secret_permissions = [
                  + "Set",
                ]
              + tenant_id          = "fb5b09d0-6c7c-4bf2-adf7-6fb61f902de9"
            },
        ]
      + id                            = (known after apply)
      + location                      = "westus2"
      + name                          = "equalvote"
      + public_network_access_enabled = true
      + resource_group_name           = "equalvote"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "fb5b09d0-6c7c-4bf2-adf7-6fb61f902de9"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_key.sops will be created
  + resource "azurerm_key_vault_key" "sops" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
        ]
      + key_size                = 2048
      + key_type                = "RSA"
      + key_vault_id            = (known after apply)
      + n                       = (known after apply)
      + name                    = "sops"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)

      + rotation_policy {
          + expire_after         = "P90D"
          + notify_before_expiry = "P29D"

          + automatic {
              + time_before_expiry = "P30D"
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>